tutorials/uvReactorSozzi2006/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | uvReactorSozzi2006: realizable k-eps RANS
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;

RAS
{
    // Realizable k-epsilon as used by Sozzi & Taghipour 2006.
    model           realizableKE;

    turbulence      on;

    viscosityModel  Newtonian;
}

// ************************************************************************* //
