tutorials/uvReactorSozzi2006/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | uvReactorSozzi2006: turbulent dissipation rate
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// epsilon = Cmu^0.75 * k^1.5 / L_t
//   Cmu  = 0.09;  k = 0.4555;  L_t = 0.07 * D_inlet = 0.07 * 0.0191 = 1.337e-3 m
//   eps  = 0.1644 * 0.3076 / 1.337e-3 = 37.83 m^2/s^3
dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 37.83;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 37.83;
    }

    outlet
    {
        type            zeroGradient;
    }

    bodyWall
    {
        type            epsilonWallFunction;
        value           uniform 37.83;
    }

    lampWall
    {
        type            epsilonWallFunction;
        value           uniform 37.83;
    }
}

// ************************************************************************* //
