tutorials/uvReactorSozzi2006/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | uvReactorSozzi2006: turbulent kinematic viscosity
   \\    /   O peration     |
    \\  /    A nd           |
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// nut_inlet = Cmu * k^2 / eps = 0.09 * 0.4555^2 / 37.83 = 4.94e-4 m^2/s
dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 4.94e-4;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 4.94e-4;
    }

    outlet
    {
        type            calculated;
        value           uniform 4.94e-4;
    }

    bodyWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }

    lampWall
    {
        type            nutkWallFunction;
        value           uniform 0;
    }
}

// ************************************************************************* //
